<h1>目次<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#章-pandas入門" data-toc-modified-id="章-pandas入門-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>章 pandas入門</a></span><ul class="toc-item"><li><span><a href="#pandasのデータ構造" data-toc-modified-id="pandasのデータ構造-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>pandasのデータ構造</a></span><ul class="toc-item"><li><span><a href="#Series(シリーズ）" data-toc-modified-id="Series(シリーズ）-5.1.1"><span class="toc-item-num">5.1.1&nbsp;&nbsp;</span>Series(シリーズ）</a></span></li><li><span><a href="#DataFrame（データフレーム）" data-toc-modified-id="DataFrame（データフレーム）-5.1.2"><span class="toc-item-num">5.1.2&nbsp;&nbsp;</span>DataFrame（データフレーム）</a></span></li><li><span><a href="#インデックスオブジェクト" data-toc-modified-id="インデックスオブジェクト-5.1.3"><span class="toc-item-num">5.1.3&nbsp;&nbsp;</span>インデックスオブジェクト</a></span></li></ul></li><li><span><a href="#pansasの重要な機能" data-toc-modified-id="pansasの重要な機能-5.2"><span class="toc-item-num">5.2&nbsp;&nbsp;</span>pansasの重要な機能</a></span><ul class="toc-item"><li><span><a href="#再インデックス付け" data-toc-modified-id="再インデックス付け-5.2.1"><span class="toc-item-num">5.2.1&nbsp;&nbsp;</span>再インデックス付け</a></span><ul class="toc-item"><li><span><a href="#シリーズの場合" data-toc-modified-id="シリーズの場合-5.2.1.1"><span class="toc-item-num">5.2.1.1&nbsp;&nbsp;</span>シリーズの場合</a></span></li><li><span><a href="#DataFrameの場合" data-toc-modified-id="DataFrameの場合-5.2.1.2"><span class="toc-item-num">5.2.1.2&nbsp;&nbsp;</span>DataFrameの場合</a></span></li></ul></li><li><span><a href="#軸から要素を削除する" data-toc-modified-id="軸から要素を削除する-5.2.2"><span class="toc-item-num">5.2.2&nbsp;&nbsp;</span>軸から要素を削除する</a></span></li><li><span><a href="#インデックス参照、選択、フィルタリング" data-toc-modified-id="インデックス参照、選択、フィルタリング-5.2.3"><span class="toc-item-num">5.2.3&nbsp;&nbsp;</span>インデックス参照、選択、フィルタリング</a></span><ul class="toc-item"><li><span><a href="#locとilocによるデータの選択" data-toc-modified-id="locとilocによるデータの選択-5.2.3.1"><span class="toc-item-num">5.2.3.1&nbsp;&nbsp;</span>locとilocによるデータの選択</a></span></li></ul></li><li><span><a href="#整数のインデックス" data-toc-modified-id="整数のインデックス-5.2.4"><span class="toc-item-num">5.2.4&nbsp;&nbsp;</span>整数のインデックス</a></span></li><li><span><a href="#算術とデータの整形" data-toc-modified-id="算術とデータの整形-5.2.5"><span class="toc-item-num">5.2.5&nbsp;&nbsp;</span>算術とデータの整形</a></span><ul class="toc-item"><li><span><a href="#算術メソッドと値の置換" data-toc-modified-id="算術メソッドと値の置換-5.2.5.1"><span class="toc-item-num">5.2.5.1&nbsp;&nbsp;</span>算術メソッドと値の置換</a></span></li><li><span><a href="#データフレームとシリーズでの演算" data-toc-modified-id="データフレームとシリーズでの演算-5.2.5.2"><span class="toc-item-num">5.2.5.2&nbsp;&nbsp;</span>データフレームとシリーズでの演算</a></span></li></ul></li><li><span><a href="#関数の適用とマッピング" data-toc-modified-id="関数の適用とマッピング-5.2.6"><span class="toc-item-num">5.2.6&nbsp;&nbsp;</span>関数の適用とマッピング</a></span></li><li><span><a href="#ソートとランク" data-toc-modified-id="ソートとランク-5.2.7"><span class="toc-item-num">5.2.7&nbsp;&nbsp;</span>ソートとランク</a></span></li><li><span><a href="#重複したラベルを持つ軸のインデックス" data-toc-modified-id="重複したラベルを持つ軸のインデックス-5.2.8"><span class="toc-item-num">5.2.8&nbsp;&nbsp;</span>重複したラベルを持つ軸のインデックス</a></span></li></ul></li><li><span><a href="#要約統計量の集計と計算" data-toc-modified-id="要約統計量の集計と計算-5.3"><span class="toc-item-num">5.3&nbsp;&nbsp;</span>要約統計量の集計と計算</a></span><ul class="toc-item"><li><span><a href="#相関と共分散" data-toc-modified-id="相関と共分散-5.3.1"><span class="toc-item-num">5.3.1&nbsp;&nbsp;</span>相関と共分散</a></span></li><li><span><a href="#一意な値、頻度の確認、所属の確認" data-toc-modified-id="一意な値、頻度の確認、所属の確認-5.3.2"><span class="toc-item-num">5.3.2&nbsp;&nbsp;</span>一意な値、頻度の確認、所属の確認</a></span></li></ul></li></ul></li></ul></div>

# 章 pandas入門

- pandasは分析ツールも持っている。
- 配列ベースの計算スタイルや関数を採用している。
- forループを使わないデータ処理を好む。
- テーブル形式のデータや不均一なデータを扱うために設計されている。
- インポート文は、__`import pandas as pd`__が慣例。
- __`from pandas import Series, Dataframe`__もインポートしておくと便利。

In [1]:
import pandas as pd
import numpy as np

## pandasのデータ構造

p136
- pandasはSeries（シリーズ）とDataFrame（データフレーム）という2つのデータ構造を持つ。

### Series(シリーズ）

p136
- 1次元の配列のようなオブジェクト。
- インデックスというデータラベルが含まれる。
- インデックスを指定しなかった場合、０からN-1（N=データ長）のインデックスが作成される。
- __`index`__属性でインデックスオブジェクトを取得できる。
- __`index.values`__属性でインデックス値を取得できる。
- __`values`__属性で値を取得できる。

In [2]:
# pd.Series([]) でSeriesオブジェクトを作成。
obj = pd.Series([4, 7, -5, 3])
print("obj = \n{}\n".format(obj))

print("obj.index = {}".format(obj.index))
print("obj.index.values = {}\n".format(obj.index.values))
print("obj.values = {}".format(obj.values))

obj =
0    4
1    7
2   -5
3    3
dtype: int64

obj.index = RangeIndex(start=0, stop=4, step=1)
obj.index.values = [0 1 2 3]

obj.values = [ 4  7 -5  3]

p136
- インデックス付きのシリーズを作成する事も可能。
- シリーズへの変更は要素全体に適用される。

In [3]:
# インデックスを指定してSeriesを作成。index=・・・
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

p137
- インデックスのラベルを使用して値にアクセスする。（インデックス番号ではNG）

In [4]:
# ラベル「a」に対応するデータ値を取得
obj2['a']

-5

In [5]:
# ラベル「d」に対応するデータ値に6を代入
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [6]:
# 複数ラベルを指定
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [7]:
# 値が 0超 であるもののみ取得。
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [8]:
# シリーズの要素全てに適用される。
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

全ての値が2倍される

In [9]:
# e（自然対数の底）を「obj2」で累乗してみる。
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

p137
- シリーズはインデックスとデータ値がマッピングされた固定長の順序付きディクショナリと捉える事も可能。

In [10]:
# 辞書と同様に、in でキー（インデックス）の存在確認ができる。
print("'b' in obj2 = {}".format('b' in obj2))
print("'e' in obj2 = {}".format('e' in obj2))

'b' in obj2 = True
'e' in obj2 = False

p137
- ディクショナリ形式のデータがある場合、それを用いてシリーズを作成できる。
- ディクショナリからシリーズを作成する場合、インデックスはソートされた上で作成される。

In [11]:
# ディクショナリ形式のデータ「sdata」を作成
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

# インデックスがソートされた上で、ディクショナリが作成される。
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

書籍だと、インデックス順位ソートされる為
- Ohio
- Oregon
- Texas
- Utah
の順になるはずだが、実行結果が違う。

p138
- インデックスを指定の順序にしたい場合は、__`index`__オプションをで並び替えることも可能。

In [12]:
# statesというリストを作成
states = ['California', 'Ohio', 'Oregon', 'Texas']

print("states = {}".format(states))
print("sdata.keys() = {}".format(sdata.keys()))

states = ['California', 'Ohio', 'Oregon', 'Texas']
sdata.keys() = dict_keys(['Ohio', 'Texas', 'Oregon', 'Utah'])

In [13]:
# index を指定して並び順を固定
obj4 = pd.Series(sdata, index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

__index__ で指定した順に並ぶ。  
__California__ に相当するデータはない為、Nanとなる。  
__Utah__ は __sdata__ に存在しない為、シリーズから除外される。

p138
- __`isnull`__関数と、__`notnull`__関数は欠損値を特定する。  
 (ブランク値に対しても同じ挙動をする。)

In [14]:
# 欠損値の確認
print("### obj4 : \n{}\n".format(obj4))
print("### obj4.isnull() : \n{}\n".format(obj4.isnull()))
print("### obj4.notnull() : \n{}".format(obj4.notnull()))

### obj4 :
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### obj4.isnull() :
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

### obj4.notnull() :
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [15]:
# ブランク値に対する確認
obj4_1 = obj4.copy()
obj4_1["California"] = ""

print("### obj4_1 : \n{}\n".format(obj4_1))
print("### obj4_1.isnull() : \n{}\n".format(obj4_1.isnull()))
print("### obj4_1.notnull() : \n{}".format(obj4_1.notnull()))

### obj4_1 :
California
Ohio          35000
Oregon        16000
Texas         71000
dtype: object

### obj4_1.isnull() :
California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

### obj4_1.notnull() :
California    True
Ohio          True
Oregon        True
Texas         True
dtype: bool

In [16]:
# None に対する確認
obj4_2 = obj4.copy()
obj4_2["California"] = None

print("### obj4_2 : \n{}\n".format(obj4_2))
print("### obj4_2.isnull() : \n{}\n".format(obj4_2.isnull()))
print("### obj4_2.notnull() : \n{}".format(obj4_2.notnull()))

### obj4_2 :
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

### obj4_2.isnull() :
California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

### obj4_2.notnull() :
California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

p139
- シリーズ同士の演算は、合致するインデックス同士で演算される。

In [17]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [18]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [19]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

obj3 と obj4で __インデックス__ が合致した値が足されている。   
なお、「Utah」はobj3には存在しているが、obj4にはないため、NaNとなっている。　5000+NaN＝NaN

p140
- シリーズ自身とインデックスに名前をつけることが可能。

In [20]:
# シリーズ自身に名前を付与
obj4.name = 'population'

# シリーズのインデックスに名前を付与
obj4.index.name = 'state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

インデックスに「state」、データに「Name: population, dtype: float64」といった形で名前が付けられた。

p140
- インデックスは置き換えることが可能。

In [21]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

objのインデックスは0～3

In [22]:
# objのインデックスにリストを代入
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

インデックスが　__['Bob', 'Steve', 'Jeff', 'Ryan']__　に置き換えられた。

### DataFrame（データフレーム）

p140
- データフレーム は順序付けられた列を持つ。
- 行と列の両方にインデックスを持っている。
- 列名でソートした上で、データフレーム に配置される（state, year, pop => pop, state, year)

In [23]:
#ディクショナリからを使って、データフレーム を作成。
data = {
    'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
    'year': [2000, 2001, 2002, 2001, 2002, 2003],
    'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]
}

frame = pd.DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002
5  3.2  Nevada  2003

p141
- 列の順番を指定する事が可能。

In [24]:
# 列の順番を指定
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

p142
- 指定した列をデータが持っていない場合は、欠損値（NaN）が代入される。

In [25]:
# 列名とインデックス名を指定してDataFrameを作成
frame2 = pd.DataFrame(
    data,
    columns=['year', 'state', 'pop', 'dept'],
    index=['one', 'two', 'three', 'four', 'five', 'six'])

frame2

       year   state  pop dept
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

dataに「dept」に対応するデータがないため、Nanが代入される。

***
p142
- __`columns`__属性で、列のインデックスオブジェクトを取得する事ができる。
- 列のインデックス名を指定してシリーズを取得する事ができる。

In [26]:
#列名を取得
frame2.columns

Index(['year', 'state', 'pop', 'dept'], dtype='object')

In [27]:
#列名を指定して、シリーズを取得
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [28]:
# シリーズを操作する事で、シリーズのインデックスや値にアクセスできる。
frame2['state']['three']

'Ohio'

In [29]:
# frame2['state'].index.name は Nan
frame2['state'].index

Index(['one', 'two', 'three', 'four', 'five', 'six'], dtype='object')

In [30]:
frame2['state'].name

'state'

In [31]:
#シリーズはデータフレーム の属性のようにアクセスする事も可能（列名が属性名の規約に沿っている場合のみ）
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

***
p143
- シリーズの要素全体に値を代入する事ができる。

In [32]:
frame2

       year   state  pop dept
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [33]:
# 「dept」の値は全てNaNであったが、16.5に上書きされる。
frame2["dept"] = 1.65
frame2

       year   state  pop  dept
one    2000    Ohio  1.5  1.65
two    2001    Ohio  1.7  1.65
three  2002    Ohio  3.6  1.65
four   2001  Nevada  2.4  1.65
five   2002  Nevada  2.9  1.65
six    2003  Nevada  3.2  1.65

In [34]:
#「dept」に定数ではなく、配列を代入してみる（配列サイズは、行数と一致している必要がある。）
frame2['dept'] = np.arange(6)
frame2

       year   state  pop  dept
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4
six    2003  Nevada  3.2     5

p144
- シリーズのインデックスに対応するものがない場合、欠損値が代入される。

In [35]:
#valというSeriesを作成
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

#「dept」にvalを代入
frame2['dept'] = val
frame2

       year   state  pop  dept
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

インデックスが合致したところに値が代入される。データフレームのインデックスに対応するデータが無い場合、NaNが代入される。

***
p144
- 存在しない列に代入を行うと、新しい列が作成される。

In [36]:
frame2

       year   state  pop  dept
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [37]:
# 存在しない列名を指定して代入
frame2["dept2"] = "hoge"
frame2

       year   state  pop  dept dept2
one    2000    Ohio  1.5   NaN  hoge
two    2001    Ohio  1.7  -1.2  hoge
three  2002    Ohio  3.6   NaN  hoge
four   2001  Nevada  2.4  -1.5  hoge
five   2002  Nevada  2.9  -1.7  hoge
six    2003  Nevada  3.2   NaN  hoge

In [38]:
# 真偽値の配列も代入できる。
frame2['eastern'] = frame2['state'] == 'Ohio'
frame2

       year   state  pop  dept dept2  eastern
one    2000    Ohio  1.5   NaN  hoge     True
two    2001    Ohio  1.7  -1.2  hoge     True
three  2002    Ohio  3.6   NaN  hoge     True
four   2001  Nevada  2.4  -1.5  hoge    False
five   2002  Nevada  2.9  -1.7  hoge    False
six    2003  Nevada  3.2   NaN  hoge    False

「eastern」という列が追加された。「state」が'Ohio'である場合は'True'が、そうでない場合は'False'が代入されている。

p144
- __`del`__キーワードで列を削除する事ができる。

In [39]:
# 削除前
frame2

       year   state  pop  dept dept2  eastern
one    2000    Ohio  1.5   NaN  hoge     True
two    2001    Ohio  1.7  -1.2  hoge     True
three  2002    Ohio  3.6   NaN  hoge     True
four   2001  Nevada  2.4  -1.5  hoge    False
five   2002  Nevada  2.9  -1.7  hoge    False
six    2003  Nevada  3.2   NaN  hoge    False

In [40]:
# delキーワードで列を削除
del frame2['eastern']
frame2

       year   state  pop  dept dept2
one    2000    Ohio  1.5   NaN  hoge
two    2001    Ohio  1.7  -1.2  hoge
three  2002    Ohio  3.6   NaN  hoge
four   2001  Nevada  2.4  -1.5  hoge
five   2002  Nevada  2.9  -1.7  hoge
six    2003  Nevada  3.2   NaN  hoge

easternという列が消えている。

p145
- ネストしたディクショナリを用いてDataFrameを作成する事ができる。

In [41]:
pop = {
    'Nevada': {
        2001: 2.4,
        2002: 2.9
    },
    'Ohio': {
        2000: 1.5,
        2001: 1.7,
        2002: 3.6
    }
}

In [42]:
# ネストしたディクショナリを使用してデータフレーム を作成
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

ネストしたディクショナリをデータフレームに渡すとpandasは  
外側のディクショナリのキー（'Nevada'と'Ohio'）を列のインデックス  
内側のディクショナリのキーを行のインデックス  
と解釈する。

In [43]:
# 転置
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [44]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [45]:
#### インデックスに合致する値だけが、データフレーム に統合される。（'2000' に対応するデータは除かれる）
pd.DataFrame(pop, index=[2002, 2001, 2003])

      Nevada  Ohio
2002     2.9   3.6
2001     2.4   1.7
2003     NaN   NaN

windowsだと　AttributeError: 'list' object has no attribute 'astype'が発生する

In [46]:
pd.__version__

'0.22.0'

In [47]:
import sys
print(sys.version)

3.6.4 |Anaconda, Inc.| (default, Jan 16 2018, 12:04:33)
[GCC 4.2.1 Compatible Clang 4.0.1 (tags/RELEASE_401/final)]

p145
- シリーズのバリューにディクショナリを使う場合。

In [48]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [49]:
# frame3の Ohio列 の最後の1行を除いて取得。
frame3['Ohio'][:-1]

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [50]:
# frame3の Nevada列 の最初の2行取得。
frame3['Nevada'][:2]

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [51]:
type(frame3['Nevada'][:2])

pandas.core.series.Series

In [52]:
# ディクショナリを作成（値はシリーズ）
pdata = {'Ohio': frame3['Ohio'][:-1], 'Nevada': frame3['Nevada'][:2]}
pdata

{'Nevada': 2000    NaN
 2001    2.4
 Name: Nevada, dtype: float64, 'Ohio': 2000    1.5
 2001    1.7
 Name: Ohio, dtype: float64}

In [53]:
pdata['Ohio']

2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [54]:
pdata['Nevada']

2000    NaN
2001    2.4
Name: Nevada, dtype: float64

In [55]:
type(pdata)

dict

In [56]:
# シリーズ値に持つディクショナリを使用してデータフレーム を作成。
pd.DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

p146
- データフレーム には__`index`__、__`columns`__ 属性がある。
- __`index`__、__`columns`__ に __`name`__属性を定義する事ができる。（オプション）
- __`values`__属性で実データを２次元のndarrayとして取得できる。

In [57]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [58]:
# インデックス名とカラム名をつけてみる。
frame3.index.name = 'year'
frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [59]:
# values属性にアクセスする事で、二次元配列が返される。
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

p146
- valuesが返すndarrayのdtypeは、全ての列に対応したdtype

In [60]:
# 文字や数値が混ざっているので object として ndarray を返却
frame2.values

array([[2000, 'Ohio', 1.5, nan, 'hoge'],
       [2001, 'Ohio', 1.7, -1.2, 'hoge'],
       [2002, 'Ohio', 3.6, nan, 'hoge'],
       [2001, 'Nevada', 2.4, -1.5, 'hoge'],
       [2002, 'Nevada', 2.9, -1.7, 'hoge'],
       [2003, 'Nevada', 3.2, nan, 'hoge']], dtype=object)

### インデックスオブジェクト

p147
- pandasのインデックスオブジェクトは、軸のラベルやその他のメタデータ（name属性など）を保持する役目を持っている。
- インデックスオブジェクトは変更不可。
- 重複したラベルを持つ事が可能。
- 重複したラベルでデータを検索すると、ラベルに合致する全てのデータを抽出する。
- インデックスオブジェクトには集合演算の為のメソッド(append, difference, intersection, union等）と属性が提供されている。

In [61]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [62]:
index[1:]

Index(['b', 'c'], dtype='object')

In [63]:
import sys
import traceback

# インデックスオブジェクトは変更不可。
try:
    # TypeError
    index[1] = 'd'
except Exception as e:
    t, v, tb = sys.exc_info()
    print("### \n{}".format(traceback.format_exception(t, v, tb)))
    print("### \n{}".format(traceback.format_tb(e.__traceback__)))

###
['Traceback (most recent call last):\n', '  File "<ipython-input-63-f26a60263aa1>", line 7, in <module>\n    index[1] = \'d\'\n', '  File "/Users/ikeday/.pyenv/versions/anaconda3-5.1.0/lib/python3.6/site-packages/pandas/core/indexes/base.py", line 1724, in __setitem__\n    raise TypeError("Index does not support mutable operations")\n', 'TypeError: Index does not support mutable operations\n']
###
['  File "<ipython-input-63-f26a60263aa1>", line 7, in <module>\n    index[1] = \'d\'\n', '  File "/Users/ikeday/.pyenv/versions/anaconda3-5.1.0/lib/python3.6/site-packages/pandas/core/indexes/base.py", line 1724, in __setitem__\n    raise TypeError("Index does not support mutable operations")\n']

In [64]:
labels = pd.Index(np.arange(3))
labels

Int64Index([0, 1, 2], dtype='int64')

In [65]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [66]:
obj2.index is labels

True

In [67]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [68]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [69]:
'Ohio' in frame3.columns

True

In [70]:
2003 in frame3.index

False

In [71]:
# 重複したラベルを持つ事が出来る。
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

p148
__表5-2　インデックスオブジェクトのメソッドと属性（抜粋）__
- __`append`__ 　　　　追加のインデックスオブジェクトを連結し、新しくインデックスオブジェクトを生成する。
- __`difference`__ 　　集合の差を計算して、その差をインデックスオブジェクトとして表現する。
- __`intersection`__ 　集合の論理積を計算する。
- __`union`__ 　　　　 和集合を計算する。
- __`isin`__ 　　　　　各値が集合に含まれているかどうかを示すブール型の配列を計算する。
- __`delete`__ 　　　　指定したi番目の要素を削除した新しいインデックスオブジェクトを作成する。
- __`drop`__ 　　　　　指定した値を削除した新しいインデックスオブジェクトを作成する。
- __`insert`__ 　　　　指定したi番目に要素を挿入して新しいインデックスオブジェクトを作成する。
- __`is_monotonic`__ 　各要素が1つ前の要素と等しいか、それよりも大きい場合にTrueが戻される。
- __`is_unique`__ 　　 インデックスオブジェクトが重複した値を持たない場合にTrueが戻される。- 
- __`unique`__ 　　　　インデックスオブジェクトから重複のない値の配列を計算する。

## pansasの重要な機能

### 再インデックス付け

p149
- __`reindex`__メソッドは、新しいインデックスに従ったデータを持つ新しいオブジェクトを作成する。
- データが__`reindex`__で指定した順に並び変えられる。  
- インデックスに対する既存の値がない場合、欠損値が代入される。

#### シリーズの場合

In [72]:
# Series作成
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

d => b => a => d　の順に並んでいる。

In [73]:
# reindexで指定した順に並び変えられる。
# インデックスに対する既存の値がない場合、欠損値が代入される。
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

p150
- __`method`__オプションで、再インデックス付けの際に穴埋めを行える。
- __`ffill`__メソッドを指定すると、値が前方に穴埋めされます。

In [74]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [75]:
# 前方の値で穴埋め。
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [76]:
# bfillで　後方のデータで穴埋め
obj3.reindex(range(6), method='bfill')

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

#### DataFrameの場合

p150
- reindexメソッドで行インデックスや列インデックスを変更することができる。
- デフォルトでは、行が再インデックス付けされる。
- 列を再インデックスしたい場合は、__`columns`__を指定する。

In [77]:
frame = pd.DataFrame(
    np.arange(9).reshape(3, 3),
    index=['a', 'c', 'd'],
    columns=['Ohio', 'Texas', 'California'])

frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

np.arange(9)で0～8のベクトル（[0,1,2,3,4,5,6,7,8]）を作成し、reshape(3,3)で3行×3列に整形。  
行ラベルに'a', 'c', 'd'、列ラベルに 'Ohio', 'Texas', 'California' という名前を付けたデータフレームを作成。

In [78]:
# bという行ラベルを追加して再インデックス
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [79]:
states = ['Texas', 'Utah', 'California']

# 列に対して再インデックス
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

データフレームから'Ohio'列が消え、'Utah'列にはNaN（欠損値）が代入されている。

p151
__表5-3　reindexメソッドの引数__
- __`index`__ 　　　インデックスに使用する新しいシーケンス。インデックスオブジェクトや、その他のPythonのシーケンス型データ構造を持つものでも指定可能。インデックスオブジェクトはコピーされずに、そのまま使用される。
- __`method`__ 　　　内挿、穴埋めの方法の指定。ffillは前方に穴埋めし、bfillは後方に穴埋めする。
- __`fill_value`__ 　再インデックス付けのときに、欠損値の代わりに使用する値。
- __`limit`__ 　　　　前方、後方穴埋めのときに、どれだけの数の（要素数の）ギャップを埋めるか、その最大値。
- __`tolerance`__ 　　前方、後方穴埋めのときに、インデックスの数値にどれくらいの差がある場合までは穴埋めをするか、その最大値。
- __`level`__ 　　　　階層型インデックスを使用している場合に、再インデックス付けを行う階層を指定する。
- __`copy`__ 　　　　Trueを指定すると、新インデックスが旧インデックスと同じである場合でも、常にデータがコピーされる。Falseを指定すると、インデックスが同じである場合にはデータがコピーされない。

### 軸から要素を削除する

p151
- __`drop`__メソッドを使うと、指定した要素が軸から削除された新しいオブジェクトを作成する。

__Series の場合__

In [80]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [81]:
#.dropで'c'を削除
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [82]:
# コピーが作成され、元データに影響はない。
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

__DataFrame の場合__

p152
- デフォルトでは 行（第0軸）が削除される。
- __`axis=1`__ または __`axis='columns'`__ を指定すると、列（第1軸）が削除される。
- __`inplace=True`__ で削除が適用元に反映される。

In [83]:
data = pd.DataFrame(
    np.arange(16).reshape(4, 4),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [84]:
# Colorado、Ohio行を削除
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
# axis=1 を指定して two列 を削除。
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [86]:
# axis='columns' でも列を削除可能
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [87]:
# dropのデフォルトは適用元に反映されない
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [88]:
# inplace=True で適用元に反映される
data.drop('Ohio', inplace=True)
data

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### インデックス参照、選択、フィルタリング

__シリーズ の場合__

p153
- シリーズでは、NumPyの配列のインデックス参照と整数値を指定して参照できる。
- シリーズのインデックス値を指定した参照も可能。
- ラベルを使ったスライシングはPythonのスライシングとは振る舞いが異なり、__終点が含まれる。__
- インデックス参照をして値を設定すると、取り出した部分が変更される。

In [89]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [90]:
# インデックスラベルで参照
obj['b']

1.0

In [91]:
# インデックス番号で参照
obj[1]

1.0

In [92]:
# インデックス番号を使用したスライシング
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [93]:
# インデックスラベルを使用した複数参照
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [94]:
# インデックス番号を使用した複数参照
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [95]:
# 2未満の値を取得
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [96]:
# インデックスラベルを使用したスライシングは終点を含む
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [97]:
# インデックス参照を値を設定すると、取り出した部分が変更される。
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

__データフレーム の場合__

p154
- インデックス参照は列に対して行われる。
- 1列を参照すると戻り値はシリーズ。
- 複数列を参照すると戻り値はデータフレーム。
- スライシングで行を選択できる。__(但し、行と列を同時にスライシングできない。）__
- 通常は、[]演算子に選択する列を指定する。
- スカラー値とデータフレームを比較して、真偽値を利用した取り扱いが可能。

In [98]:
data = pd.DataFrame(
    np.arange(16).reshape(4, 4),
    index=['Ohio', 'Colorado', 'Utah', 'New York'],
    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [99]:
# two 列を取得
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [100]:
# three、one列の順に取得
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [101]:
# スライシングを使用して行参照
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [102]:
# スライシングは行のみ（列は不可）
try:
    # TypeError: unhashable type: 'slice'
    data[:2, :3]
except Exception as e:
    t, v, tb = sys.exc_info()
    print("### \n{}".format(traceback.format_exception(t, v, tb)))

###
['Traceback (most recent call last):\n', '  File "<ipython-input-102-afd1ce66d71e>", line 4, in <module>\n    data[:2, :3]\n', '  File "/Users/ikeday/.pyenv/versions/anaconda3-5.1.0/lib/python3.6/site-packages/pandas/core/frame.py", line 2139, in __getitem__\n    return self._getitem_column(key)\n', '  File "/Users/ikeday/.pyenv/versions/anaconda3-5.1.0/lib/python3.6/site-packages/pandas/core/frame.py", line 2146, in _getitem_column\n    return self._get_item_cache(key)\n', '  File "/Users/ikeday/.pyenv/versions/anaconda3-5.1.0/lib/python3.6/site-packages/pandas/core/generic.py", line 1840, in _get_item_cache\n    res = cache.get(item)\n', "TypeError: unhashable type: 'slice'\n"]

In [103]:
# 行スライシング結果を再度行スライシング
data[:2][:1]

      one  two  three  four
Ohio    0    1      2     3

In [104]:
# data[:2][:1]の別記法
data[0:1]

      one  two  three  four
Ohio    0    1      2     3

In [105]:
# three列の値が 5 より大きい行を取得
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [106]:
# 真偽値を取得
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [107]:
# 真偽値を利用して値を代入
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### locとilocによるデータの選択

p156
- __`loc`__ で軸ラベルを使用した参照が出来る。
- __`iloc`__ で整数のインデックス位置による参照が出来る。
- __`loc`__、__`iloc`__ はスライシングが利用できる。

In [108]:
# Colorado行の　two、three 列 を取得
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [109]:
# インデックス位置2の行（Utah）のインデックス位置 3、0、1の列（four,one,two）を取得
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [110]:
#インデックス位置2の行（Utah）の値を取得
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [111]:
# 2,3行目の　4,1,2列目を参照
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [112]:
# スライシングが利用可能（先頭行から、Utah まで、列は two を参照。
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [113]:
# 全ての行と、インデックス番号 0～2（3の手前）の列のデータを、さらに three 列が 5超と いう条件でスライシング
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

p157  
__データフレームにおけるインデックス参照の方法__
- __`df[val]`__  　　　　　　　　基本は列ラベルを用いて選択。スライシング記法で行を選択できる。
- __`df.loc[val]`__  　　　　　　行ラベルを指定して1つ以上の行選択する。
- __`df.loc[:, val]`__ 　　　　　1つ以上の列を、ラベルを指定して選択する。
- __`df.loc[val1, val2]`__ 　　　行、列を、ラベルを指定して選択する。
- __`df.iloc[where]`__ 　　　　　データフレームの1つ以上の行を、整数のインデックス位置を指定して選択する。
- __`df.iloc[:, where]`__ 　　　　　1つ以上の列を、整数のインデックス位置を指定して選択する。
- __`df.iloc[where_i, where_j]`__ 　行、列を、整数のインデックス位置を指定して選択する。
- __`df.at[label_i, label_j]`__ 　　行と列のラベルを指定して、1つの値を取得する。
- __`df.iat[i, j]`__ 　　　　　　　　　　行と列のインデックス位置（整数）を指定して、1つの値を取得する。
- __`reindexメソッド`__ 　　　　 　　　　行や列を、ラベルを指定して選択する。
- __`get_value, set_valueメソッド`__ 　　行と列のラベルを指定して、1つの値を取得する。

### 整数のインデックス

p158
- ラベルに数値が使用されていると、ラベルで参照しているのか、インデックス位置でアクセスしているのかをPandasは判断できない。
- ラベルに文字を使用すれば、曖昧さがなくなる。
- インデックスに整数を使う場合は、常にインデックス位置が利用される。
- 正確に扱う為に、__`loc`__ や __`iloc`__ を使用した方が良い。

In [114]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [115]:
try:
    # KeyError     
    ser[-1]
except Exception as e:
    t, v, tb = sys.exc_info()
    print("### \n{}".format(traceback.format_exception(t, v, tb)))

###
['Traceback (most recent call last):\n', '  File "<ipython-input-115-6f11ad57d38d>", line 3, in <module>\n    ser[-1]\n', '  File "/Users/ikeday/.pyenv/versions/anaconda3-5.1.0/lib/python3.6/site-packages/pandas/core/series.py", line 623, in __getitem__\n    result = self.index.get_value(self, key)\n', '  File "/Users/ikeday/.pyenv/versions/anaconda3-5.1.0/lib/python3.6/site-packages/pandas/core/indexes/base.py", line 2560, in get_value\n    tz=getattr(series.dtype, \'tz\', None))\n', '  File "pandas/_libs/index.pyx", line 83, in pandas._libs.index.IndexEngine.get_value\n', '  File "pandas/_libs/index.pyx", line 91, in pandas._libs.index.IndexEngine.get_value\n', '  File "pandas/_libs/index.pyx", line 139, in pandas._libs.index.IndexEngine.get_loc\n', '  File "pandas/_libs/hashtable_class_helper.pxi", line 811, in pandas._libs.hashtable.Int64HashTable.get_item\n', '  File "pandas/_libs/hashtable_class_helper.pxi", line 817, in pandas._libs.hashtable.Int64HashTable.get_item\n', 'KeyError: -1\n']

 <font color='red'><b>「-1」というラベルを参照したいのか、インデックス位置（後ろから1番目）を指定したいのか判断できない為、エラーとなる。</b></font>

In [116]:
# ラベルが数字の場合は、インデックス位置で参照される 
ser[1]

1.0

In [117]:
# ラベルに文字を採用
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [118]:
ser2[-1]

2.0

 <font color='red'><b>ラベルが文字である為、インデックス位置（後ろから1番目）を利用する事が可能。</b></font>

### 算術とデータの整形

p159
- ラベルが合致しているデータ同士で演算が行われる。
- 合致していない部分は、デフォルトで__Nan__として計算される。

__シリーズ の場合__

In [119]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [120]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [121]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

__片方のオブジェクトにしかないラベルには欠損値（NaN）が代入される。__

__データフレーム の場合__

In [122]:
df1 = pd.DataFrame(
    np.arange(9.).reshape(3, 3),
    columns=list('bcd'),
    index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [123]:
df2 = pd.DataFrame(
    np.arange(12.).reshape(4, 3),
    columns=list('bde'),
    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [124]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

__演算対象の行・列 のラベルが完全に一致していないと`NaN`との計算として扱われる。__

#### 算術メソッドと値の置換

p161
- __`fill_value`__ を 算術メソッド使用すると欠損値の補完が可能。
- 各算術メソッドは、__`r`__ で始まる対応するメソッドを持っていて、オブジェクトと引数の関係が反転したもの。

In [125]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [126]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2.loc[1, 'b'] = np.nan
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [127]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

__通常の演算だと、欠損値+値＝欠損値となってしまう。__

In [128]:
# fill_valueで欠損値をゼロで補完
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [129]:
# 1を df1 の各値で除算 ( inf=1/0 )　
1 / df1

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [130]:
# 算術メソッドを使った表記。結果は上と同じ。
df1.rdiv(1)

          a         b         c         d
0       inf  1.000000  0.500000  0.333333
1  0.250000  0.200000  0.166667  0.142857
2  0.125000  0.111111  0.100000  0.090909

In [131]:
# 算術メソッドでなくても、fill_value の指定が可能。
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

p163  
__柔軟な算術メソッド__
- __`add, radd`__ 　　　　　　加算を行うメソッド
- __`sub, rsub`__ 　　　　　　減算を行うメソッド
- __`div, rdiv`__ 　　　　　　除算を行うメソッド
- __`floordiv, rfloordiv`__ 　除算を行った後、床関数を適用するメソッド
- __`mul, rmul`__ 　　　　　　乗算を行うメソッド
- __`pow, rpow`__ 　　　　　　累乗を行うメソッド

#### データフレームとシリーズでの演算

p163
- NumPyと同様に、異なる次元（例：データフレームとシリーズ）の間での算術も定義されている。

p164
- データフレームとシリーズの算術において、デフォルトではシリーズのインデックスとデータフレームの列がマッチングされ行方向に計算が行われる。
- インデックスの値がデータフレームの列やシリーズのインデックスに見つからなかった場合は、インデックスの和集合で再インデックスされる。
- 列方向に演算を行いたい場合は、算術用のメソッドを使う。

In [132]:
frame = pd.DataFrame(
    np.arange(12.).reshape(4, 3),
    columns=list('bde'),
    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [133]:
series = frame.iloc[0]
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [134]:
# 行方向に算術計算
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [135]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])
series2

b    0
e    1
f    2
dtype: int64

In [136]:
# インデックスの和集合で再インデックス
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [137]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [138]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [139]:
# 列方向に算術計算を行う場合は算術メソッドを使用する。
frame.sub(series3, axis='index')
#axis='index' は　axis=0 と同義

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 関数の適用とマッピング

p165
- NumPyのufunc（配列の要素に適用可能なメソッド群）は、pandasのオブジェクトでも機能する。
- 集計処理（sum や meanなど）は、データフレームのメソッドとして使う事が出来る。

p166
- __`apply`__ でデータフレームの列方向に関数が適用される。
- __`apply`__ において、__`axis='columns'`__ データフレームの行方向に関数が適用される。
- データフレーム全体に関数を適用したい場合は__`applymap`__ を使用する。

p167
- 特定のシリーズに関数を適用したい場合は、__`mapメソッド`__を使用する。

In [140]:
# 平均ゼロ、分散1の標準正規分布に従う乱数を4行×3列の形で生成。
frame = pd.DataFrame(
    np.random.randn(4, 3),
    columns=list('bde'),
    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    1.994838  0.892394 -0.628329
Ohio   -1.360297  1.073708 -2.862003
Texas  -0.452504  1.002432 -0.497283
Oregon -1.128835  0.542325  1.227985

In [141]:
# 絶対値を求める関数が利用可能
np.abs(frame)

               b         d         e
Utah    1.994838  0.892394  0.628329
Ohio    1.360297  1.073708  2.862003
Texas   0.452504  1.002432  0.497283
Oregon  1.128835  0.542325  1.227985

In [142]:
# 列に対して関数を適用
f = lambda x: x.max() - x.min()
frame.apply(f)

b    3.355136
d    0.531382
e    4.089987
dtype: float64

In [143]:
# 行に対して関数を適用
frame.apply(f, axis='columns')

Utah      2.623167
Ohio      3.935710
Texas     1.499715
Oregon    2.356820
dtype: float64

In [144]:
# 最小と最大値をシリーズとして返す
def f2(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [145]:
frame.apply(f2)

            b         d         e
min -1.360297  0.542325 -2.862003
max  1.994838  1.073708  1.227985

In [146]:
# データフレーム全体に関数を適用したい場合はapplymap
format2 = lambda x: '%.2f' % x

frame.applymap(format2)

            b     d      e
Utah     1.99  0.89  -0.63
Ohio    -1.36  1.07  -2.86
Texas   -0.45  1.00  -0.50
Oregon  -1.13  0.54   1.23

In [147]:
# 特定のシリーズに関数を適用する
frame['e'].map(format2)

Utah      -0.63
Ohio      -2.86
Texas     -0.50
Oregon     1.23
Name: e, dtype: object

### ソートとランク

p167
- __`sort_indexメソッド`__ で、行や列のインデックスを辞書順でソートする事が出来る。
- __`sort_indexメソッド`__ は新しいオブジェクトを返す。
- データフレームでは、軸毎にインデックスをソート。
- __`axis=1`__ で列ラベルでソート。
- __`ascending=False`__ で降順ソート。

In [148]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj

d    0
a    1
b    2
c    3
dtype: int64

In [149]:
# インデックスのアルファベット順でソート
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [150]:
frame = pd.DataFrame(
    np.arange(8).reshape(2, 4),
    index=['three', 'one'],
    columns=['d', 'a', 'b', 'c'])

frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [151]:
# デフォルトは行ラベルでソート
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [152]:
# 列ラベルでソート
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [153]:
# ascending:False で降順ソート
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

p168
- 値でソートしたい場合は、__`sort_valuesメソッド`__ でソート。
- デフォルトでは、欠損値はシリーズの末尾にソートされる。
- __`by`__ オプションでソートキーを指定できる。

In [154]:
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [155]:
# 欠損値は末尾にソート
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [156]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [157]:
# ソートキーを指定
frame.sort_values(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [158]:
# ソートキーを複数指定
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

- __`rank`__ ランキングが出力できる。
- デフォルトでは同順位（タイ）の場合、順位の平均値が出力される。
- __`methodオプション`__ で同一順序のランキング付けを調整できる。

In [159]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [160]:
# 同順位の場合、順位の平均値が出力される
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [161]:
#デフォルト。タイとなったグループにそれぞれ平均値を代入
obj.rank(method='average')

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [162]:
# 観測した順にランク付けする。
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [163]:
# タイとなったグループに最大値を代入
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [164]:
# タイとなったグループに最小値を代入
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [165]:
# ランクを詰める。（インデックス0と2のrankはminだと6だが、denseだと5になっている。）
obj.rank(method='dense')

0    5.0
1    1.0
2    5.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

p170
- データフレームの場合、行か列でランク付け出来る。

In [166]:
frame = pd.DataFrame({
    'b': [4, 7, -3, 2],
    'a': [0, 1, 0, 1],
    'c': [-2, 5, 8, -2.5]
})

frame

   a  b    c
0  0  4 -2.0
1  1  7  5.0
2  0 -3  8.0
3  1  2 -2.5

In [167]:
# 列方向でランク付け
frame.rank()

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [168]:
# 行方向でランク付け
frame.rank(axis='columns')

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

In [169]:
# axis='columns' と同義
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### 重複したラベルを持つ軸のインデックス

p171
- __`is_unique属性`__ で、インデックスのラベルが一意かどうかを確認する事ができる。
- 参照時、重複したインデックスがある場合はシリーズが戻される。一方、重複がない場合にはスカラー値が戻される。

In [170]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [171]:
#インデックスが一意であるか確認
obj.index.is_unique

False

In [172]:
# 重複のあるインデックス参照
obj['a']

a    0
a    1
dtype: int64

In [173]:
# 重複のないインデックス参照
obj['c']

4

In [174]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.131233 -1.620647  0.797339
a  0.461758  0.347983 -0.482374
b -1.492480  0.643428  0.810348
b  0.238600  1.553689 -0.040073

In [175]:
# 重複のあるインデックス参照
df.loc['b']

         0         1         2
b -1.49248  0.643428  0.810348
b  0.23860  1.553689 -0.040073

## 要約統計量の集計と計算

p171
- pandasでは、数学的、統計的なメソッドが用意されており、NumPy配列と違って欠損値を扱う機能が組み込まれている。
- __`axis`__ で集計する軸を指定できる。
- __`skipna=False`__ で欠損値を計算対象にする事が出来る。


p173
- __`describe`__ は要約統計量を出力する。
- __`describe`__ は値が数値でない場合は度数や頻度等を出力する。

In [176]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [177]:
# 欠損地を計算対象にしない
df.sum()

one    9.25
two   -5.80
dtype: float64

In [178]:
# NaNはゼロ扱いにせず、対象外
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [179]:
# 行方向に集計
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [180]:
# 欠損値を計算対象にする。
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [181]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [182]:
# 列毎に最大の値を持つインデックスを返却
df.idxmax()

one    b
two    d
dtype: object

In [183]:
# 列毎に累積
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [184]:
# 要約統計量
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

値が数値でない場合、describeの出力は違ったものとなる。

In [185]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [186]:
# 値が数値でない場合は個数
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

- count：要素の個数
- unique：ユニークな（一意な）値の要素の個数
- top：最頻値
- freq：最頻値（この場合'a'）の頻度（出現回数）

__要約統計量の一覧__
- __`count`__ 　　　　　　NAではない要素の数。
- __`describe`__ 　　　　シリーズやデータフレームの列に対して、複数の要約統計量を求める。
- __`min, max`__ 　　　　最小値、最大値を求める。
- __`argmin, argmax`__ 　最小値、最大値が得られた要素のインデックス位置（整数）を求める。
- __`idxmin, idxmax`__ 　最小値、最大値が得られた要素のラベルを求める。
- __`quantile`__ 　　　　データのパーセント点を0から1の範囲で求める。
- __`sum`__ 　　　 合計値。
- __`mean`__ 　　　平均値。
- __`median`__ 　　中央値（50パーセント点）。
- __`mad`__ 　　　 平均値からの平均絶対偏差。
- __`prod`__ 　　　すべての値の積。
- __`var`__ 　　　 標本分散。
- __`std`__ 　　　 標本標準偏差。
- __`skew`__ 　　　標本歪度（3次のモーメント）。
- __`kurt`__ 　　　標本尖度（4次のモーメント）。
- __`cumsum`__ 　　累積合計値。
- __`cummin, cummax`__ 　累積の最小値と最大値。
- __`cumprod`__ 　 　累積の積。
- __`diff`__ 　　　　1次の階差を求める（時系列データで便利）。
- __`pct_change`__ 　パーセントの変化を求める。

### 相関と共分散

p174
- __`corrメソッド`__ で相関係数
- __`covメソッド`__ で共分散

In [187]:
# 株価の時系列データ
price = pd.read_pickle('examples/yahoo_price.pkl')
price.head()

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.990226  313.062468  113.304536  25.884104
2010-01-05  28.038618  311.683844  111.935822  25.892466
2010-01-06  27.592626  303.826685  111.208683  25.733566
2010-01-07  27.541619  296.753749  110.823732  25.465944
2010-01-08  27.724725  300.709808  111.935822  25.641571

In [188]:
# 出来高の時系列データ
volume = pd.read_pickle('examples/yahoo_volume.pkl')
volume.head()

                 AAPL      GOOG      IBM      MSFT
Date
2010-01-04  123432400   3927000  6155300  38409100
2010-01-05  150476200   6031900  6841400  49749600
2010-01-06  138040000   7987100  5605300  58182400
2010-01-07  119282800  12876600  5840600  50559700
2010-01-08  111902700   9483900  4197200  51197400

In [189]:
import pandas_datareader.data as web

In [190]:
# パーセント変化
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [191]:
# MSFT（マイクロソフト）とIBMのリターンの相関係数
returns['MSFT'].corr(returns['IBM'])

0.4997636114415116

In [192]:
# MSFT（マイクロソフト）とIBMのリターンの共分散
returns['MSFT'].cov(returns['IBM'])

8.870655479703549e-05

In [193]:
# データフレーム全般の相関係数
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [194]:
# データフレーム全般の共分散
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

p176
- __`corrwithメソッド`__ で 特定の行や列と、別のシリーズやデータフレームに対する相関を求めることができる。

In [195]:
# IBMと他の企業の相関係数
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [196]:
# データフレーム同士（出来高と利益）の相関係数
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

### 一意な値、頻度の確認、所属の確認

p177
- __`uniques`__はシリーズ中で一意な値の配列を返す。但し、戻り値は、必ずしもソートされた順番にはなっていない。
- __`value_countsメソッド`__は、シリーズに含まれる値の頻度を返却する。
- __`value_countsメソッド`__は、pandasのトップレベルのメソッドとしても使うことができ、配列やシーケンスにも使える。
- __`isinメソッド`__は、ベクトル形式の集合を指定して、その値のいずれかが含まれるかを確認できる。

p178
__一意な値、頻度の確認、所属の確認をするメソッド__
- __`isin`__ 			各シリーズの値が、引数で渡されたシーケンスの値に含まれるかどうかを示す真偽値の配列を求める。
- __`match`__ 		ある配列を、一意な値を持つ別の配列にするために、各値のインデックス位置を求める。データを整理するときや結合するときなどに役立つ。
- __`unique`__ 		シリーズの値のうち、一意な値の集合を観測された順に取り出す。
- __`value_counts`__ 	シリーズに含まれる一意な値をインデックスとして、そのインデックスに対応する値の頻度を求める。頻度の降順に並ぶ

In [197]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [198]:
# ユニークな値を戻す
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [199]:
# ソート
uniques.sort()
uniques

array(['a', 'b', 'c', 'd'], dtype=object)

In [200]:
# 要素数を取得
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [201]:
# トップレベルのメソッドとして使用可能
pd.value_counts(obj.values)

c    3
a    3
b    2
d    1
dtype: int64

In [202]:
# ソートしたくない場合
pd.value_counts(obj.values, sort=False)

b    2
a    3
c    3
d    1
dtype: int64

In [203]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [204]:
# b または c が代入されているか確認
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [205]:
# フィルタリングして、部分集合を返却
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [206]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [207]:
unique_vals = pd.Series(['c', 'b', 'a'])
unique_vals

0    c
1    b
2    a
dtype: object

In [208]:
# to_match の値に合致する unique_vals のインデックス整数を返却
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [209]:
data = pd.DataFrame({
    'Qu1': [1, 3, 4, 3, 4],
    'Qu2': [2, 3, 1, 2, 3],
    'Qu3': [1, 5, 2, 4, 4]
})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [210]:
# 列方向に値をカウント、欠損値はゼロ扱い
data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0